InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПользователиДляРассылки</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПривязкаТелефонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаТелефонов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Привязка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользованияSIMКарт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОсновныеТелефоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеТелефоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Привязка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользованияSIMКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ТелефоннаяКнига/Ext/Module.bsl
Функция ОчиститьНомер(Номер)
	ЧистыйНомер = "";
	Для Ном = 1 По СтрДлина(Номер) Цикл
		Сим = Сред(Номер, Ном, 1);
		Если Найти("0123456789", Сим)>0 Тогда
			ЧистыйНомер = ЧистыйНомер + Сим;
		КонецЕсли;
	КонецЦикла;
	Возврат ЧистыйНомер;
КонецФункции

&НаСервере
Процедура УдалитьНомер(Номер, Привязка)

	МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Объект   = Привязка; 
	МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон; 
	МенеджерЗаписи.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСлужебный;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Если ОчиститьНомер(МенеджерЗаписи.Представление) = Номер Тогда
			МенеджерЗаписи.Удалить(); 	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


Процедура ПроверитьТелефонПоРегистрам(Телефон, ПроверятьДальше = Истина,  ИскатьВКонтактнойИнформации=Ложь) Экспорт
	
	// Найдем текущую привязку
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПривязкаТелефоновСрезПоследних.Номер,
	|	ПривязкаТелефоновСрезПоследних.Привязка,
	|	ПривязкаТелефоновСрезПоследних.Назначение
	|ИЗ
	|	РегистрСведений.ПривязкаТелефонов.СрезПоследних КАК ПривязкаТелефоновСрезПоследних
	|ГДЕ
	|	ПривязкаТелефоновСрезПоследних.Номер = &Номер";
	Запрос.УстановитьПараметр("Номер", Телефон);
	
	ТЗ = Запрос.Выполнить().Выгрузить();	
	Если ТЗ.Количество() = 0 Тогда   
		ТекущаяПривязка = Неопределено;
		Текущееназначение = Неопределено;   
	Иначе
		ТекущаяПривязка = ТЗ[0].Привязка;
		Текущееназначение = ТЗ[0].Назначение;	
	КонецЕсли;	
	
	// Удалим лищние записи регистра основных телефонов
	Запрос.Текст = "ВЫБРАТЬ
	|	ОсновныеТелефоны.Привязка,
	|	ОсновныеТелефоны.Назначение
	|ИЗ
	|	РегистрСведений.ОсновныеТелефоны КАК ОсновныеТелефоны
	|ГДЕ
	|	ОсновныеТелефоны.Телефон = &Телефон";
	Запрос.УстановитьПараметр("Телефон", Телефон);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ЕстьОсновной = Ложь;
	Для Каждого Стр Из ТЗ Цикл
		Если НЕ Стр.Привязка = ТекущаяПривязка ИЛИ НЕ Стр.Назначение = ТекущееНазначение Тогда
			МенеджерЗаписи = РегистрыСведений.ОсновныеТелефоны.СоздатьМенеджерЗаписи(); 
			МенеджерЗаписи.Привязка   = Стр.Привязка; 
			МенеджерЗаписи.Назначение = Стр.Назначение; 
			МенеджерЗаписи.Телефон = Телефон;
			МенеджерЗаписи.Прочитать(); 	
			МенеджерЗаписи.Удалить(); 
			
			Если Стр.Назначение = Справочники.НазначенияИспользованияSIMКарт.СлужебныйТелефон ИЛИ Телефон.ДляГолосовойСвязи Тогда
				УдалитьНомер(Телефон.Код, Стр.Привязка);
			КонецЕсли;
		Иначе
			ЕстьОсновной = Истина;	
		КонецЕсли;
	КонецЦикла;
	
	//Создадим основной, если его нет
	Если НЕ ТекущаяПривязка = Неопределено и НЕ ЕстьОсновной Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОсновныеТелефоны.Привязка,
		               |	ОсновныеТелефоны.Назначение,
		               |	ОсновныеТелефоны.Телефон
		               |ИЗ
		               |	РегистрСведений.ОсновныеТелефоны КАК ОсновныеТелефоны
		               |ГДЕ
		               |	ОсновныеТелефоны.Привязка = &Привязка
		               |	И ОсновныеТелефоны.Назначение = &Назначение";
		Запрос.УстановитьПараметр("Привязка", ТекущаяПривязка);
		Запрос.УстановитьПараметр("Назначение", Текущееназначение);						   
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ПроверятьДальше Тогда
			
			Для каждого Тел ИЗ ТЗ Цикл
				ПроверитьТелефонПоРегистрам(Тел.телефон, Ложь);
			КонецЦикла;
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ОсновныеТелефоны.Привязка,
			               |	ОсновныеТелефоны.Назначение,
			               |	ОсновныеТелефоны.Телефон
			               |ИЗ
			               |	РегистрСведений.ОсновныеТелефоны КАК ОсновныеТелефоны
			               |ГДЕ
			               |	ОсновныеТелефоны.Привязка = &Привязка
			               |	И ОсновныеТелефоны.Назначение = &Назначение";
			Запрос.УстановитьПараметр("Привязка", ТекущаяПривязка);
			Запрос.УстановитьПараметр("Назначение", Текущееназначение);						   
			ТЗ = Запрос.Выполнить().Выгрузить();			
		КонецЕсли;
		Если ТЗ.Количество() = 0 Тогда	
			СделатьОсновным(Телефон, Текущееназначение, ТекущаяПривязка, Ложь)
		КонецЕсли;
	КонецЕсли;
	
	Если ИскатьВКонтактнойИнформации Тогда
	КонецЕсли;	
	
КонецПроцедуры


Процедура СделатьОсновным(СимКарта, Назначение, Абонент, Проверка = Истина) Экспорт
		
	МенеджерЗаписи = РегистрыСведений.ОсновныеТелефоны.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Привязка   = Абонент; 
	МенеджерЗаписи.Назначение = Назначение; 
	МенеджерЗаписи.Телефон = СимКарта; 
	МенеджерЗаписи.Записать();
	
	Если Строка(Строка(ТипЗнч(Абонент))) = "Физические лица" И Назначение = Справочники.НазначенияИспользованияSIMКарт.СлужебныйТелефон  Тогда
		МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.Объект	= Абонент; 
		МенеджерЗаписи.Тип		= Перечисления.ТипыКонтактнойИнформации.Телефон; 
		МенеджерЗаписи.Вид		= Справочники.ВидыКонтактнойИнформации.ТелефонСлужебный;
		МенеджерЗаписи.Представление = СимКарта.Код;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	
	Если Проверка Тогда ПроверитьТелефонПоРегистрам(СимКарта) КонецЕсли;	
	
КонецПроцедуры
